const regexp = {
  username: /^[a-zA-Z]([a-zA-Z0-9_]{4,19})+$/, // 用户名
  password: /^(?![^a-zA-Z]+$)(?!\D+$)[0-9a-zA-Z]{6,16}$/, // 密码
  mobile: /^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(1[6|7|8][0-9]))\d{8}$/, // 手机号码
  tel: /^0\d{2,3}-\d{7,8}(-\d{3,5}){0,1}$/, // 固定电话
  phone: /^(0\d{2,3}-\d{7,8}(-\d{3,5}){0,1})|(((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(1[6|7|8][0-9]))\d{8})$/, // 固话+手机【支持分机号】
  identity: /^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|X)$/, // 身份证
  bankAccount: /^([1-9]{1})(\d{7,25})$/, // 银行卡号【招商银行16，交通银行17位，其他19位，信用卡16位，旧卡18位】8-26
  currency: /^(([1-9]\d*)|0)(\.\d{0,2})?$/, // 浮点型(保留两位小数)
  currencyM: /^(?!0+(?:\.0+)?$)(([1-9]\d*)|0)(\.\d{0,2})?$/, // 大于零的浮点型(保留两位小数)
  currencyMF: /^(?!0+(?:\.0+)?$)(([1-9]\d*)|0)(\.\d{0,4})?$/, // 大于零的浮点型(保留四位小数)
  quantity: /^(([1-9]\d*)|0)(\.\d*)?$/, // 浮点型
  percent: /^\d\.([1-9]{1,2}|[0-9][1-9])$|^[1-9]\d{0,1}(\.\d{1,2}){0,1}$|^100(\.0{1,2}){0,1}$/, // 大于0小于100的浮点型(保留两位小数)
  posInt: /^[1-9]\d*$/, // 正整数
  negInt: /^-[1-9]\d*$/, // 负整数
  staffNumber: /^[0-9A-Za-z]{1,6}$/, // 员工工号
  ipAddress: /^((25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))\.){3}(25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))$/, // ip地址
  trim: /(^\s*)|(\s*$)/, // 两边空格
  ltrim: /(^\s*)/, // 左边空格
  rtrim: /(\s*$)/, // 右边空格
  creditCode: /^[^_IOZSVa-z\W]{2}\d{6}[^_IOZSVa-z\W]{10}$/ // 统一社会信用代码
};

export default regexp;
